import numpy as np
import pandas as pd

In [5]:
from numpy.random import randn

In [6]:
np.random.seed(101)

In [7]:
df=pd.DataFrame(randn(5,4),["A","B","C","D","E"],["W","X","Y","Z"])

In [8]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [9]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [10]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
df["W"]>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [12]:
df[df["W"]>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
df[df["Z"]<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [14]:
result=df[df["Z"]<0]

In [15]:
result

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [17]:
#bài tập lấy ra dãy số series cột X trừ số 0.740122

In [23]:
result1=df[df["W"]>0]

In [24]:
result1

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [20]:
result1["X"]

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [21]:
df[df["W"]>0]["X"]

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [26]:
df[df["W"]>0][["Y","X"]]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [28]:
#df[df["W"]>0 and df["Y"]>1]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [29]:
df[(df["W"]>0) & (df["Y"]>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df[(df["W"]>0) | (df["Y"]>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [32]:
# Sắp xếp lại cột chỉ số của dataframe.
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [33]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
newindex="CA NY WY OR CO".split()

In [35]:
newindex

['CA', 'NY', 'WY', 'OR', 'CO']

In [36]:
df["State"]=newindex

In [37]:
df

          W         X         Y         Z State
A  2.706850  0.628133  0.907969  0.503826    CA
B  0.651118 -0.319318 -0.848077  0.605965    NY
C -2.018168  0.740122  0.528813 -0.589001    WY
D  0.188695 -0.758872 -0.933237  0.955057    OR
E  0.190794  1.978757  2.605967  0.683509    CO

In [46]:
df.set_index("State",inplace=True)

In [47]:
df

              W         X         Y         Z
State
CA     2.706850  0.628133  0.907969  0.503826
NY     0.651118 -0.319318 -0.848077  0.605965
WY    -2.018168  0.740122  0.528813 -0.589001
OR     0.188695 -0.758872 -0.933237  0.955057
CO     0.190794  1.978757  2.605967  0.683509

In [48]:
df.loc["CA"]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: CA, dtype: float64

In [49]:
df.loc["CA"]["W"]

2.706849839399938

In [56]:
df.loc[:,"W"]

State
CA    2.706850
NY    0.651118
WY   -2.018168
OR    0.188695
CO    0.190794
Name: W, dtype: float64